# Пишемо кредитний калькулятор:
#
# Потрібен кредитний калькулятор який може прорахувати виплати які потрібно робити клієнту кожного місяця для погашення
# всього кредиту. Кредит береться клієнтом в уставнові під певний процент -2% в місяць перші 2 роки та 4% в місяць
# наступні роки. Процент нараховується що місяця на остачу що залишилaся після виплати.
#
# Програма запитує суму кредиту у клієнта.
#
# Вивестипомісячно суму яку потрібно пратити клєнту щоб розрахуватися з кредитом за 1, за 5років.
#
# Очікується що вивід будеоформлений в у вигляді симетрично відофрматованих стовбців.
#
# Повино бути присутнім у виводі інформаціі - номер місяця, сума виплати за місяць, та скільки процентів нараховано
# за місяць.

loan = int(input("Сума кредиту ->"))
period = int(input("Термін кредиту, місяців ->"))
body = loan / period
if period < 25:
    for i in range(1, period + 1):
        rate = loan * 0.24 / 12
        monthly_payment = body + rate
        loan = loan - body
        print(f"|   Місяць: {i}   |   Сума до сплати: {monthly_payment}   |   Нараховано процентів {rate}   |")
else:
    for i in range(1, period + 1):
        if i < 25:
            rate = loan * 0.24 / 12
            monthly_payment = body + rate
            loan = loan - body
            print(f"|   Місяць: {i}   |   Сума до сплати: {monthly_payment}   |   Нараховано процентів {rate}   |")
        elif i >= 25:
            rate = loan * 0.48 / 12
            monthly_payment = body + rate
            loan = loan - body
            print(f"|   Місяць: {i}   |   Сума до сплати: {monthly_payment}   |   Нараховано процентів {rate}   |")
